In [1]:
import pandas as pd
import numpy as np

In [23]:
sachin = pd.read_csv("C:/Users/91798/DSML Practise/foundations/Maths - Prob & Stat/1 - Probability Intro/Sachin_ODI.csv")

sachin

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,False,False
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,True,False
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,True,False
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,False,True
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,True,False

## Use `sachin_odi.csv` to calculate :

i) The probability of scoring century given that the opposition is South Africa.

ii) The probability that the opposition is South Africa given that he scored a century.

In [13]:
# Calculating probabilty when Opposition is South Africa and scored century

sa_cen_len = sachin.loc[(sachin["Opp"] == "South Africa") & sachin["century"]]

sa_cen_len.shape[0]

5

In [14]:
sa_len = sachin.loc[(sachin["Opp"] == "South Africa")]
sa_len.shape[0]

44

In [20]:
# i) The probability of scoring century given that the opposition is South Africa.

print(sa_cen_len.shape[0] / sa_len.shape[0])

0.11363636363636363

In [18]:
cen_len = sachin.loc[sachin["century"]]

cen_len.shape[0]

46

In [19]:
# The probability that the opposition is South Africa given that he scored a century.

print(sa_cen_len.shape[0] / cen_len.shape[0])

0.10869565217391304

## The covid_m1.csv contains details of whether a patient was given a medicine (m1) or not, and whether the patient survived (s) or not.

Calculate the following using the above given dataset.
- `P[m1 and s]`
- `P[m1 | s]`
- `P[s | m1]`

In [28]:
covid = pd.read_csv("covid.csv")
# covid.rename(columns={"0": "medicine", "0.1" : "survived"}, inplace = True)

In [29]:
covid.head()

   m1  s
0   0  0
1   0  1
2   0  1
3   0  0
4   1  1

In [30]:
covid.shape

(1000, 2)

In [31]:
covid["m1"] = covid["m1"].apply(lambda x: np.where(x , True, False))
covid["s"] = covid["s"].apply(lambda x: np.where(x , True, False))

In [32]:
covid

        m1      s
0    False  False
1    False   True
2    False   True
3    False  False
4     True   True
..     ...    ...
995  False   True
996  False   True
997  False  False
998  False   True
999  False  False

[1000 rows x 2 columns]

In [33]:
# Probabilty of given medicine and patient survived

med_sur = covid.loc[(covid["m1"] & covid["s"])]

med_sur.shape[0]

print(med_sur.shape[0] / covid.shape[0])

0.095

In [35]:
sur_len = covid.loc[covid["s"]].shape[0]

print(sur_len / covid.shape[0])

0.7

In [38]:
0.095/0.7

0.13571428571428573

In [49]:
146/300

0.4866666666666667